#!/usr/bin/env python3
# awsmpg.py
# программа, которая генерирует "случайную" поэзию
# название - Awesome Poetry Generator
# версия 0.3

import random

# реальные имена
names = ["Тимофей","Оксана","Ярик","Анатолий","Лысый",
		"Наталя","Тёма","Олежка","Диана",
		"Димас","Лёха","Джеки Софт","Шмара","Нубас","Костян"]
# реальные имена (кого?)
namewhoms = ["Тимофея","Оксану","Ярика","Анатолия","Лысого",
		"Наталю","Тёму","Олежку","Диану",
		"Димаса","Лёху","Джеки Софта","Шмару","Нубаса","Костяна"]
# имя существительное
nouns = ["жига","бутылка","телефон","еврей","подоконник",
		"подружаня","гитара","паренёк","банка","творожок",
		"чекушку","стакан","псина","интрига","ржавый гвоздь программы",
		"бродяга","почтальон","сига","мандаринчик","змеюка",
		"торба","ебасос"]
# имя существительное (кого?)
nounwhoms = ["жигу","бутылку","телефон","еврея","подоконник",
		"подружаню","гитару","паренька","банку","творожок",
		"чекушку","стакан","псину","интригу","ржавого гвоздя программы",
		"бродягу","почтальона","сигу","мандаринчик","змеюку",
		"торбу","ебасос"]
# глаголы
verbs = ["запилил","заплакал","уничтожил","расстрелял","украсил",
		"позвонил","укусил","погладил","разпетлял","заценил",
		"подогнал","насыпал","загрустил","сожрал","полетел",
		"закадрил","отшлёпал","подмутил","насмешил","удивил",
		"завалил","закурил","встал","понял","втащил"]
# наречия (как именно?)
adverbs1 = ["жёстко","печально","прекрасно","неумолимо","неуклюже",
		"забавно","ужасно","прикольно","прохладно","сипло",
		"волшебно","иронично","грубо","бодро","понтово",
		"идеально","быстро","в смысле","хорошо","медленно",
		"тупо","сочно","жизненно","именно","качественно",
		"зачётно","плотно"]
# наречия (место действия, время, причина)
adverbs2 = ["за углом","почему-то","вчера","только что","в туалете",
		"сгоряча","сдуру","в поле","год назад","на твоей мамаше",
		"прошлой зимой","везде","в клубасе","под партой","за щекой",
		"неспроста","поневоле","просто так","для прикола","для угара",
		"очень","весьма","еле-еле","в могиле","чисто случайно",
		"из принципа","шоб смешно было","на льде","с приходом весны","бо холодно стало"]

#____________________
# основная функция
def makeVerse():
	i = 0
	tx = ""

	while i < 4:
		# выбираем случайные слова
		name = random.choice(names)
		namewhom = random.choice(namewhoms)
		noun = random.choice(nouns)
		nounwhom = random.choice(nounwhoms)
		verb = random.choice(verbs)
		adverb1 = random.choice(adverbs1)
		adverb2 = random.choice(adverbs2)
		
		# выбираем последовательность
		j = random.randint(0,10)
	
		# если имя/существительное женского рода - к глаголу добавляем "а"
		if j in [3,4,5,8]:
			if name in ["Оксана","Наталя","Диана","Шмара"]:
				verb += "а"
		else:
			if noun in ["жига","бутылка","подружаня","гитара","псина","сига","интрига","змеюка","торба","банка"]:
				verb += "a"

		# формируем строку, которая содержит четверостишие
		if j == 0:
			tx += noun+" "+adverb1+" "+adverb2+" "+verb		# жига волшебно в поле полетела
		elif j == 1:
			tx += noun+" "+adverb2+" "+adverb1+" "+verb		# жига в поле волшебно полетела
		elif j == 2:
			tx += adverb2+" "+adverb1+" "+noun+" "+verb		# в поле волшебно жига полетела
		elif j == 3:
			tx += name+" "+adverb2+" "+adverb1+" "+verb		# Оксана в поле волшебно полетела
		elif j == 4:
			tx += adverb2+" "+name+" "+adverb1+" "+verb		# в поле Оксана волшебно полетела
		elif j == 5:
			tx += name+" "+adverb1+" "+verb+" "+namewhom	# Оксана волшебно укусила Тимофея
		elif j == 6:
			tx += adverb2+" "+noun+" "+verb+" "+namewhom	# в поле жига укусила Оксану
		elif j == 7:
			tx += adverb1+" "+noun+" "+verb+" "+adverb2		# волшебно жига полетела в поле
		elif j == 8:
			tx += name+" "+verb+" "+nounwhom+" "+adverb1	# Оксана укусила жигу волшебно
		elif j == 9:
			tx += adverb1+" "+noun+" "+verb					# волшебно жига полетела
		else:
			tx += adverb2+" "+noun+" "+verb+" "+adverb1		# в поле жига полетела волшебно
	
		i += 1
		
		# добавляем пустую строку
		if i != 4:
			tx += "\n"

	return tx


